test/cassettes/quotation.yml

---
http_interactions:
- request:
    method: post
    uri: "{VERTEX_SOAP_API}"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId>{VERTEX_TRUSTED_ID}</TrustedId></Login><QuotationRequest
        transactionType="SALE"><LineItem lineItemNumber="0"><Date>2018-11-15</Date><Customer><Destination><StreetAddress1>11
        Wall Street</StreetAddress1><City>New York</City><MainDivision>NY</MainDivision><PostalCode>10005</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product>t-shirts</Product><Quantity>7</Quantity><ExtendedPrice>35.50</ExtendedPrice></LineItem><LineItem
        lineItemNumber="1"><Date>2018-11-14</Date><Customer><Destination><StreetAddress1>1600
        Pennsylvania Ave NW</StreetAddress1><City>Washington</City><MainDivision>DC</MainDivision><PostalCode>20500</PostalCode></Destination></Customer><Seller><Company>CustomInkStores</Company></Seller><Product>t-shirts</Product><Quantity>4</Quantity><ExtendedPrice>25.40</ExtendedPrice><Discount><DiscountAmount>2.23</DiscountAmount></Discount></LineItem><Discount><DiscountAmount>5.40</DiscountAmount></Discount></QuotationRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1333'
      Connection:
      - close
      Host:
      - connect.vertexsmb.com
      User-Agent:
      - http.rb/2.2.2
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 20 Nov 2018 16:24:01 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '3715'
      Connection:
      - close
      Vary:
      - Accept-Encoding
      Soapaction:
      - '""'
      Server:
      - ''
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header></soapenv:Header><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId></TrustedId>
        </Login>
        <QuotationResponse documentDate="2018-11-20" transactionType="SALE"><Discount><DiscountAmount>5.4</DiscountAmount>
        </Discount>
        <SubTotal>60.9</SubTotal>
        <Total>62.42</Total>
        <TotalTax>1.52</TotalTax>
        <LineItem lineItemNumber="0"><Seller><Company>CustomInk</Company>
        </Seller>
        <Customer><Destination taxAreaId="330612010"><StreetAddress1>11 Wall Street</StreetAddress1>
        <City>New York</City>
        <MainDivision>NY</MainDivision>
        <PostalCode>10005</PostalCode>
        </Destination>
        </Customer>
        <Product>t-shirts</Product>
        <Quantity>7.0</Quantity>
        <FairMarketValue>38.537</FairMarketValue>
        <ExtendedPrice>35.5</ExtendedPrice>
        <Discount><DiscountAmount>3.037</DiscountAmount>
        </Discount>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="24354">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Sales and Compensating Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="25353">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="DISTRICT" jurisdictionId="79774"><![CDATA[METROPOLITAN COMMUTER TRANSPORTATION DISTRICT]]></Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1"><![CDATA[Metropolitan Commuter Transportation District]]></Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <TotalTax>0.0</TotalTax>
        </LineItem>
        <LineItem lineItemNumber="1"><Seller><Company>CustomInkStores</Company>
        </Seller>
        <Customer><Destination taxAreaId="90010010"><StreetAddress1>1600 Pennsylvania Ave NW</StreetAddress1>
        <City>Washington</City>
        <MainDivision>DC</MainDivision>
        <PostalCode>20500</PostalCode>
        </Destination>
        </Customer>
        <Product>t-shirts</Product>
        <Quantity>4.0</Quantity>
        <FairMarketValue>29.993</FairMarketValue>
        <ExtendedPrice>25.4</ExtendedPrice>
        <Discount><DiscountAmount>4.593</DiscountAmount>
        </Discount>
        <Taxes taxResult="TAXABLE" taxType="SALES" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="5283">DISTRICT OF COLUMBIA</Jurisdiction>
        <CalculatedTax>1.52</CalculatedTax>
        <EffectiveRate>0.06</EffectiveRate>
        <Taxable>25.4</Taxable>
        <Imposition impositionId="1"><![CDATA[Gross Sales and Compensating Use Tax]]></Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        <TaxRuleId>7757835</TaxRuleId>
        <BasisRuleId>71372</BasisRuleId>
        </Taxes>
        <TotalTax>1.52</TotalTax>
        </LineItem>
        </QuotationResponse>
        <ApplicationData><ResponseTimeMS>10.8</ResponseTimeMS>
        </ApplicationData>
        </VertexEnvelope></soapenv:Body></soapenv:Envelope>
    http_version: 
  recorded_at: Tue, 20 Nov 2018 16:24:01 GMT
recorded_with: VCR 4.0.0
