test/cassettes/tax_exempt/invoice.yml

---
http_interactions:
- request:
    method: post
    uri: "<VERTEX_SOAP_API>CalculateTax70"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId><VERTEX_TRUSTED_ID></TrustedId></Login><InvoiceRequest
        transactionType="SALE" documentNumber="tax-exempt-31337" documentDate="2018-11-30"><LineItem
        lineItemNumber="1" taxDate="2018-11-30"><Customer isTaxExempt="true"><Destination><StreetAddress1>2910
        District Ave</StreetAddress1><StreetAddress2>Ste. 300</StreetAddress2><City>Fairfax</City><MainDivision>VA</MainDivision><PostalCode>22031</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product
        productClass="53103000">4600</Product><ExtendedPrice>50.00</ExtendedPrice></LineItem></InvoiceRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '943'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Fri, 06 Mar 2020 11:19:46 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '2803'
      Connection:
      - keep-alive
      Soapaction:
      - '""'
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId></TrustedId>
        </Login>
        <InvoiceResponse documentNumber="tax-exempt-31337" documentDate="2018-11-30" transactionType="SALE"><SubTotal>50.0</SubTotal>
        <Total>50.0</Total>
        <TotalTax>0.0</TotalTax>
        <LineItem lineItemNumber="1"><Seller><Company>CustomInk</Company>
        </Seller>
        <Customer><Destination taxAreaId="470590000"><StreetAddress1>2910 District Ave</StreetAddress1>
        <StreetAddress2>Ste. 300</StreetAddress2>
        <City>Fairfax</City>
        <MainDivision>VA</MainDivision>
        <PostalCode>22031</PostalCode>
        </Destination>
        </Customer>
        <Product productClass="53103000">4600</Product>
        <Quantity>1.0</Quantity>
        <FairMarketValue>50.0</FairMarketValue>
        <ExtendedPrice>50.0</ExtendedPrice>
        <Taxes taxResult="EXEMPT" taxType="SALES" rateClassification="Exempt" situs="DESTINATION" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="39067">VIRGINIA</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Exempt>50.0</Exempt>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Retail Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="EXEMPT" taxType="SALES" rateClassification="Exempt" situs="DESTINATION" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="COUNTY" jurisdictionId="39378">FAIRFAX</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Exempt>50.0</Exempt>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="EXEMPT" taxType="SALES" rateClassification="Exempt" situs="DESTINATION" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="DISTRICT" jurisdictionId="97100">REGIONAL TRANSPORTATION DISTRICT</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Exempt>50.0</Exempt>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <TotalTax>0.0</TotalTax>
        <AssistedParameters><AssistedParameter paramName="destination.taxAreaId" phase="PRE" ruleName="Pre-Cutover Vertex Cloud Default Taxation Tax Assist Rule" originalValue="0">470590000</AssistedParameter>
        </AssistedParameters>
        </LineItem>
        </InvoiceResponse>
        <ApplicationData><ResponseTimeMS>27.3</ResponseTimeMS>
        </ApplicationData>
        </VertexEnvelope></soapenv:Body></soapenv:Envelope>
    http_version: null
  recorded_at: Fri, 06 Mar 2020 11:19:46 GMT
recorded_with: VCR 5.1.0
